#list slicing หรือลิสสไลชิ่ง คือการแบ่งข้อมูลเป็นส่วนๆ
#คือการทำเหมือนกับฟังก์ชั่น range เลยคือมี start:stop:step แต่จะใช้ : แทน ,
#ซึ่ง start นี้ไม่จำเป็นต้องเขียนก็ได้ถ้าไม่เขียนจะเริ่มที่ 0
#ส่วน stop จะไม่ถูกรวมหรือไม่ถึงค่านั่นนั้นเองเช่น stop ที่ 50จะไม่หยุดที่50แต่จะหยุดที่49แทน
#และ step คือค่าที่นับไปจนถึง stop นับเท่าไหร่แล้วแต่เรากำหนดเลยถ้าไม่กำหนดจะเริ่มที่ 0

#ตัวอย่าง
>>> l = [1,2,3,4,5,6,7,8,9,10]
>>> l[1:] #เริ่มที่1
[2, 3, 4, 5, 6, 7, 8, 9, 10]

>>> l[5:] #เริ่มที่5
[6, 7, 8, 9, 10]

>>> l[:5] #หยุดที่ 5
[1, 2, 3, 4, 5]
>>> 

>>> l[1:2] #เริ่ม1หยุด2
[2]

>>> l[2:10:2] #เริ่ม2หยุด10นับทีละ2
[3, 5, 7, 9]

>>> l[::-1] #เน็กกะทีบสเต็บหรือคือการย้อน
[10, 9, 8, 7, 6, 5, 4, 3, 2, 1]

>>> l[:] #copy list
[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

#Example
months = ['Jan','Fed','Mar','Apr','May','Jun',
          'Jul','Aug','sep','Oct','Nov','Dec'
          ]
q1 = months[0:3]
q2 = months[3:6]
q3 = months[6:9]
q4 = months[9:13]
print("____________________")
print(f'/  {q1}  /')
print(f'/  {q2}  /')
print(f'/  {q3}  /')
print(f'/  {q4}  /')
print("____________________")












