#list with methods คือการทำอะไรสักอย่างกับสมาชิกใน list
list.append() คือการเพิ่มค่าไปที่ท้ายสุดของ list
list.reverse() คือการสลับลำดับของ list จากเดิมเคยเป็นยังไวก็จะกลับอีกทางหนึ่ง
list.sort() คือการเรียงรำดับของสมาชิก ถ้าเป็นตัวเลขเรียงจากน้อยไปมาก

#-- list.append() คือการเพิ่มค่าไปที่ท้ายสุดของ list
>>> list = []
list.append(10)
list
[10]

>>> list.append(20)
>>> list
[10, 20]
>>>

###list.reverse() คือการสลับลำดับของ list จากเดิมเคยเป็นยังไวก็จะกลับอีกทางหนึ่ง
>>> list = [1,2,3,4]
>>>list.reverse()
>>> list
[4, 3, 2, 1]

>>> list.reverse()
>>> list
[1, 2, 3, 4]
>>>


##list.sort() คือการเรียงรำดับของสมาชิก ถ้าเป็นตัวเลขเรียงจากน้อยไปมาก
>>> list = [9,6,4,7,3,1,2]
>>> list.sort()
>>> list
[1, 2, 3, 4, 6, 7, 9]

#2
[1, 2, 3, 4, 6, 7, 9]
>>> list.sort(reverse=True)
>>> list
[9, 7, 6, 4, 3, 2, 1]
>>> 




