#คือการสร้าง list ขึ้นมาใหม่โดยมีเงือนไข
#list2 =[expression for item in list1]
#จะเหมือนกับกับอันนี้
list = open("D:\Computer and Programming\DATA\codeing_data.txt").read().splitlines()
scores = [] #ทำการสร้าง listเปล่าๆมา
for i in list :
    scores.append(float(i)) #แปลงเป็นfloatแล้วaddข้อมูลไปไว้ในlistเปล่าที่สร้างไว้ด้วยappend()
print(scores)

#หรือคือการเขียนย่อให้สั่นลง
#ตัวอย่าง
#>>> list1 = [1,2,3,4,5]
#>>> list2 = [i*2 for i in list1] #ต้องการสร้างlistใหม่โดยที่listเก่าคูณ2ทุกตัว
#>>> list2
#[2, 4, 6, 8, 10]


#>>> list1 = [1,2,3,4,5] 
#>>> list2 = [i**2 for i in list1] #ต้องการสร้างlistใหม่โดยที่listเก่ายกกำลัง2ทุกตัว
#>>> list2
#[1, 4, 9, 16, 25]
#>>>

#>>> list1 = [1,2,3,4,5,6,7]
#>>> list2 = sum([i**2 for i in range(1,11)]) #ต้องการสร้างlistใหม่โดยที่หาผลรวมของทุกตัวในlistเก่ายกกำลัง2
#>>> list2
#385
#>>>

#From the following code, what is the value of q?

#p = [7, 8, 9, 10, 11, 12]
#q = [x+3 for x in p if x%2 == 0]
#โค้ดนี้ทำงานได้ดังนี้:

#1. กำหนดค่าเริ่มต้นของ `p` ให้เป็น `[7, 8, 9, 10, 11, 12]`.
#2. สร้าง list comprehension โดยทำการวนลูปผ่านทุกๆ สมาชิกใน `p`.
#3. สำหรับแต่ละสมาชิก `x` ใน `p`, เช็คว่า `x` หารด้วย 2 ลงตัวหรือไม่ (หมายถึง `x` เป็นเลขคู่หรือไม่).
#4. ถ้าเงื่อนไขเป็นจริง (`x % 2 == 0`), ให้ทำการเพิ่มค่า `x+3` เข้าไปใน list ใหม่ `q`.
#5. สร้าง list `q` ที่เก็บผลลัพธ์ที่ได้จากการทำงานข้างต้น.

#ดังนั้นผลลัพธ์ที่ได้คือ `q` ซึ่งจะเป็น `[11, 13, 15]` โดยที่ 11 มาจาก 8 + 3, 13 มาจาก 10 + 3, และ 15 มาจาก 12 + 3 ตามลำดับครับ!