# list creation หรือการสร้าง list คือการสร้างตัวแปรแล้วใส่[]เช่น  list = []เป็นต้นมีอยู่ 5แบบ
list1 = [] #list แบบเปล่าๆ
list2 = [10,20,30,40] #แบบ int
list3 = [2.0,3.0,40.4] #แบบ float
list4 = ['Hello Bro','Good bey'] #แบบ str
#แล้วทุกแบบสามารถสร้างข้อมูลกี่ตัวก็ได้
list5 = ['Hello word',20,3.5] #แบบผสม

# list Mender access หรือการเรียกใช้ค่าที่้อยู่ในlist
list = [9,5,7,2,5]
#วิธีเรียกใช้คือใช้ index คือ 0,1,2,3,4,...
list[0] = 9
list[3] = 2
list[-1] = 5

#list are mutable หรือคือการเปลี่ยนแปลงค่าใน list
list = [2,5,4,67,8,90]
#การเปลี่ยนค่าคือใช้ indexมาแทนตำแหน่งที่ต้องการเปลี่ยนแล้ว =ได้เลย
list[0] = 50
>>>>>>list = [50,5,4,67,8,90]
list[-1] = 100
>>>>>list = [50,5,4,67,8,100]

# หรือถ้าต้องการเพิ่มค่าเข้าไปใช้คำสั่ง list.append()
lst = [2, 3, 4]
>>> lst.append(90)
>>> lst
[2, 3, 4, 90,]
>>> lst.append(100) ### ไม่จำเป็นต้องใส่เป็น lst.append ก็ได้ใสตัวแปรที่เราสร้างแทน lst ก็ได้
>>> lst
[2, 3, 4, 90, 100]

#การหาขนาดของ list ใช้ lenได้เลย
>>> list = [1,2,3,4,5]
>>> len(list)
>>> 5

#การเอา listไปใช้ใน for loop

>>> list = [21,54,23,54,64,]
>>> for x in list:
    print(x)
>>> 21
>>> 54
>>> 23
>>> 54
>>> 64

# 2
f= 100
list = [21,54,23,54,64,]
for x in list:
    print(f)

>>> 100
>>> 100
>>> 100
>>> 100
>>> 100

#ปริ้นตาม index












